<?php
//前提条件：必须是一个有序列表
//解题思路：
//1 将数组排序
//2 寻找中间数。中间数=（开始数+结尾数）/2
//3 判断中间数。如果中间数比查找数小，就在中间数和结尾数中查找。反之在开始数和中间数中查找
//4 多次循环，找出查找数的下标
$a = [4,3,3,2,1,1234,3,4,5,6,7,7,8,4,21,3243,54,5,2,32,2,32,3,2,32,32,3,2,14254,5,99,43,65,6,653,65,4];
//$a =[4,3,1,2];
sort($a);
$guess = 324322;

$len = count($a);
$start = 0;
$end = $len -1;

while($len >= $end){
   $mid = intval(($start + $end)/2);
    if ($guess == $a[$mid]){
        echo $mid;exit;
    }
    if ($guess > $a[$mid]) {
        $start= $mid;
    }else{
        $end = $mid;
    }
}
